brew "gcc"

brew "bun"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mise"
brew "neovim"
brew "node"
brew "ripgrep"
brew "rtk"
brew "sheldon"
brew "starship"
brew "tmux"
brew "wget"

cask "copilot-cli"
cask "font-moralerspace-hw" if OS.mac?
